html/RL.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-12-29 Mo 22:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>RL</title>
<meta name="author" content="si" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">RL</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb776804">1. Markov Decision Process (MDP)</a></li>
<li><a href="#orgb4a248c">2. Bellman Equation</a></li>
<li><a href="#orgeb6730f">3. Dynamic Programming Iterations in RL</a>
<ul>
<li><a href="#org4f544ab">3.1. Value Iteration</a></li>
<li><a href="#org174d8e5">3.2. Policy Iteration</a>
<ul>
<li><a href="#orgff8975a">3.2.1. Phase 1: Policy Evaluation (The Inner Loop)</a></li>
<li><a href="#orga799e28">3.2.2. Phase 2: Policy Improvement (The Outer Loop)</a></li>
</ul>
</li>
<li><a href="#org349955a">3.3. Truncated Policy Iteration</a></li>
</ul>
</li>
<li><a href="#org7f17b15">4. Monte Carlo Methods in Reinforcement Learning</a>
<ul>
<li><a href="#org2304316">4.1. 1. MC Basic (The Theoretical Baseline)</a></li>
<li><a href="#org37513a5">4.2. 2. MC Exploring Starts (The Efficient Simulator)</a></li>
<li><a href="#orgec12b7b">4.3. 3. MC Epsilon-Greedy (The Practical Solution)</a>
<ul>
<li><a href="#orgdea1935">4.3.1. Core Concept: Soft Policies</a></li>
<li><a href="#org03068b3">4.3.2. Exploration vs. Exploitation</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4118dc8">5. PPO</a>
<ul>
<li><a href="#orga2fb1c4">5.1. From Policy Gradient TO PPO</a></li>
</ul>
</li>
<li><a href="#orga335e4c">6. DeepSeek</a>
<ul>
<li><a href="#orgf727247">6.1. Multi-head Latent Attention mechanismus</a></li>
<li><a href="#org09392be">6.2. MoE</a>
<ul>
<li><a href="#orgb3d8a2f">6.2.1. with shared Experts for common sense training</a></li>
<li><a href="#org3063247">6.2.2. load balance</a></li>
</ul>
</li>
<li><a href="#orgf422380">6.3. Multi token prodiction</a>
<ul>
<li><a href="#org77648af">6.3.1. Orignal idea:</a></li>
<li><a href="#org0a24b3f">6.3.2. OpenAI thinking:</a></li>
<li><a href="#org5035f7f">6.3.3. Deepseek thinking</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgb776804" class="outline-2">
<h2 id="orgb776804"><span class="section-number-2">1.</span> Markov Decision Process (MDP)</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><b>State</b>: the set of states \( S \)
<ul class="org-ul">
<li>at a time point, for all parts, how the world looks like.</li>
<li>State space: at a time point, for all parts, how the world could look like</li>
</ul></li>
<li><b>Action</b>: the set of actions \( \mathcal{A}(s) \) is associated with state \( s \in S \)
<ul class="org-ul">
<li>at a time point, for each parts, what I do.</li>
<li>Action space : at a time point, for each parts, what I could do</li>
</ul></li>
<li><b>Reward</b>: the set of rewards \( \mathcal{R}(s, a) \)</li>

<li><b>Trajectory</b>
<ul class="org-ul">
<li>episode, return: sum of discount return \(\gamma\) in a episode(trajectory)</li>
</ul></li>

<li><b>State transition probability</b>:
<ul class="org-ul">
<li>state transition: at a time point, if I did one operation, what the world is changed to.</li>
<li>at a time point, if I did one operation, How the world can be changed.</li>
<li>At state \( s \), taking action \( a \), the probability to transit to state \( s' \) is    \( p(s' \mid s, a) \)</li>
</ul></li>
<li><b>Reward probability</b>:  
At state \( s \), taking action \( a \), the probability to get reward \( r \) is    \( p(r \mid s, a) \)</li>
<li><b>Policy</b>
<ul class="org-ul">
<li>deterministic &amp; stochastic</li>
<li>At state \( s \), the probability to choose action \( a \) is   \( \pi(a \mid s)  \)</li>
</ul></li>
</ul>


<ul class="org-ul">
<li><p>
<b>Markov property</b>
Memoryless property:
\[
  p(s_{t+1} \mid a_{t+1}, s_t, \ldots, a_1, s_0)
  =
  p(s_{t+1} \mid a_{t+1}, s_t)
  \]
</p>

<p>
\[
  p(r_{t+1} \mid a_{t+1}, s_t, \ldots, a_1, s_0)
  =
  p(r_{t+1} \mid a_{t+1}, s_t)
  \]
</p></li>
</ul>
</div>
</div>
<div id="outline-container-orgb4a248c" class="outline-2">
<h2 id="orgb4a248c"><span class="section-number-2">2.</span> Bellman Equation</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><b>Return</b> : summary of all discount return in one complete trajectory</li>

<li><b>State Value</b>: expectation of  Return for all possiable trajectories
 \[ V_{\pi}(s) = \sum_{a} \pi(a|s) \sum_{s', r} p(s', r | s, a) \left[ r + \gamma V_{\pi}(s') \right] \]
Relationship to action value:    \[ V_{\pi}(s) = \sum_{a \in \mathcal{A}} \pi(a|s) Q_{\pi}(s, a) \]</li>

<li><b>Action Value</b>: expectation of  Return for all possiable trajectories  after taking a specified action
 \[ Q_{\pi}(s, a) = \sum_{s', r} p(s', r | s, a) \left[ r + \gamma \sum_{a'} \pi(a'|s') Q_{\pi}(s', a') \right] \]
Relationship to state value   \[ Q_{\pi}(s, a) = \sum_{s', r} p(s', r | s, a) \left[ r + \gamma V_{\pi}(s') \right] \]</li>
</ul>


<ul class="org-ul">
<li><b>Bellman Optimality Equation</b> is bellman equation with the best policy</li>
</ul>
</div>
</div>
<div id="outline-container-orgeb6730f" class="outline-2">
<h2 id="orgeb6730f"><span class="section-number-2">3.</span> Dynamic Programming Iterations in RL</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org4f544ab" class="outline-3">
<h3 id="org4f544ab"><span class="section-number-3">3.1.</span> Value Iteration</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Value Iteration combines policy improvement and a single step of policy evaluation into one operation.
</p>
<ul class="org-ul">
<li><b><b>Initialization:</b></b> Start with an arbitrary initial value for all states (e.g., \(v_0 = 0\)).</li>
<li><b><b>Iteration:</b></b>
<ol class="org-ol">
<li><b>Implicit Policy Update:</b> For all states, apply all possible action (Q-table), look ahead to find the best action.
\[ \pi_{k+1} = \arg\max_{\pi} \left( r_{\pi} + \gamma P_{\pi} v_k \right) \]</li>
<li><b>Value Update:</b> Use that best action to update the state value immediately.
\[ v_{k+1} = r_{\pi_{k+1}} + \gamma P_{\pi_{k+1}} v_k \]</li>
</ol></li>
</ul>
</div>
</div>
<div id="outline-container-org174d8e5" class="outline-3">
<h3 id="org174d8e5"><span class="section-number-3">3.2.</span> Policy Iteration</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Policy Iteration separates the process into two distinct phases. Crucially, the <b><b>Policy Evaluation</b></b> phase is itself an iterative process that looks very similar to Value Iteration, but with a <b>fixed</b> policy.
</p>
</div>
<div id="outline-container-orgff8975a" class="outline-4">
<h4 id="orgff8975a"><span class="section-number-4">3.2.1.</span> Phase 1: Policy Evaluation (The Inner Loop)</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
This phase starts with a policy \(\pi\) and calculates its value \(v_{\pi}\).
</p>
<ul class="org-ul">
<li><b><b>Input:</b></b> The current fixed policy \(\pi_k\).</li>
<li><b><b>Process:</b></b> We iterate to find the value by performing "Value Updates" repeatedly.
<ol class="org-ol">
<li>Initialize a value estimate \(v\) (e.g., \(v=0\)).</li>
<li>Apply the Bellman Expectation Operator repeatedly (infinite steps):
\[ v_{i+1} = r_{\pi_k} + \gamma P_{\pi_k} v_i \]</li>
<li><b><b>Stop</b></b> when \(v\) converges (i.e., \(i \to \infty\)).</li>
</ol></li>
<li><b><b>Output:</b></b> The converged state-value function \(v_{\pi_k}\).</li>
</ul>
</div>
</div>
<div id="outline-container-orga799e28" class="outline-4">
<h4 id="orga799e28"><span class="section-number-4">3.2.2.</span> Phase 2: Policy Improvement (The Outer Loop)</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
Once we know exactly how good the current policy \(\pi_k\) is (from Phase 1), we make it greedy.
</p>
<ul class="org-ul">
<li><b><b>Process:</b></b>
\[ \pi_{k+1} = \arg\max_{\pi} \left( r_{\pi} + \gamma P_{\pi} v_{\pi_k} \right) \]</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org349955a" class="outline-3">
<h3 id="org349955a"><span class="section-number-3">3.3.</span> Truncated Policy Iteration</h3>
<div class="outline-text-3" id="text-3-3">
<p>
The mathematical connection is defined by the depth of the evaluation step (the number of iterations \(j\) in Phase 1):
</p>
<ul class="org-ul">
<li><b><b>Value Iteration</b></b> is a special case of Truncated Policy Iteration where the evaluation depth is \(j=1\).</li>
<li><b><b>Policy Iteration</b></b> is the limit of Truncated Policy Iteration where the evaluation depth \(j \to \infty\).</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org7f17b15" class="outline-2">
<h2 id="org7f17b15"><span class="section-number-2">4.</span> Monte Carlo Methods in Reinforcement Learning</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org2304316" class="outline-3">
<h3 id="org2304316"><span class="section-number-3">4.1.</span> 1. MC Basic (The Theoretical Baseline)</h3>
<div class="outline-text-3" id="text-4-1">
<p>
This is the simplest form, adapted directly from Policy Iteration logic but using sample returns instead of models.
</p>
<ul class="org-ul">
<li><b>Theory:</b>
<ul class="org-ul">
<li>Operates in strict distinct steps: <b><b>Policy Evaluation</b></b> (wait for many episodes) \(\rightarrow\) <b><b>Policy Improvement</b></b> (update policy).</li>
<li>Uses the <b><b>Initial-Visit Strategy</b></b>: Only the start of an episode is used to update the value of the starting state-action pair \((s_0, a_0)\). Intermediate steps in the episode are ignored for updates.</li>
</ul></li>
<li><b>Limitation:</b>
<ul class="org-ul">
<li><b><b>Low Sample Efficiency</b></b>: Wastes data by ignoring subsequent state visits in an episode.</li>
<li><b><b>Impractical</b></b>: Requires collecting "sufficiently many episodes" for <b>every</b> state-action pair before making a single policy update.</li>
</ul></li>
</ul>
</div>
</div>
