html/RL.html
<div id="outline-container-org37513a5" class="outline-3">
<h3 id="org37513a5"><span class="section-number-3">4.2.</span> 2. MC Exploring Starts (The Efficient Simulator)</h3>
<div class="outline-text-3" id="text-4-2">
<p>
An extension designed to fix sample efficiency but introduces a strong dependency on environment control.
</p>
<ul class="org-ul">
<li><b>Theory:</b>
<ul class="org-ul">
<li><b><b>Data Efficiency</b></b>: Uses the <b><b>Every-Visit Strategy</b></b> (or sub-episode decomposition). One long episode is broken down into multiple "sub-episodes" to update values for every state visited, not just the start.</li>
<li><b><b>Episode-by-Episode Update</b></b>: Updates the policy immediately after a single episode (Generalized Policy Iteration), rather than waiting for a batch.</li>
</ul></li>
<li><b>Limitation:</b>
<ul class="org-ul">
<li><b><b>The "Exploring Starts" Assumption</b></b>: It requires the environment to be able to start an episode at <b>any</b> random state-action pair \((s, a)\).</li>
<li><b><b>Real-world Friction</b></b>: This is often impossible in physical reality (e.g., you cannot initialize a robot in a specific "falling over" state instantly).</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgec12b7b" class="outline-3">
<h3 id="orgec12b7b"><span class="section-number-3">4.3.</span> 3. MC Epsilon-Greedy (The Practical Solution)</h3>
<div class="outline-text-3" id="text-4-3">
<p>
This method removes the unrealistic "Exploring Starts" assumption, making MC methods viable for real-world learning where you cannot control the starting state.
</p>
</div>
<div id="outline-container-orgdea1935" class="outline-4">
<h4 id="orgdea1935"><span class="section-number-4">4.3.1.</span> Core Concept: Soft Policies</h4>
<div class="outline-text-4" id="text-4-3-1">
<p>
Instead of forcing the environment to <b>start</b> randomly, we force the agent to <b>behave</b> randomly occasionally.
</p>
<ul class="org-ul">
<li><b><b>Goal</b></b>: Ensure all state-action pairs are visited "sufficiently many times" without external resets.</li>
<li><b><b>Mechanism</b></b>: Uses a <b><b>Soft Policy</b></b> ( \(\epsilon\) -greedy), meaning there is always a non-zero probability of taking any action in any state.</li>
</ul>
</div>
</div>
<div id="outline-container-org03068b3" class="outline-4">
<h4 id="org03068b3"><span class="section-number-4">4.3.2.</span> Exploration vs. Exploitation</h4>
<div class="outline-text-4" id="text-4-3-2">
<p>
The algorithm balances these two conflicting goals via the parameter \(\epsilon\) (epsilon).
</p>

<ul class="org-ul">
<li>Exploration ( The \(\epsilon\) component)
<ul class="org-ul">
<li><b><b>Purpose</b></b>: To discover new strategies and ensure the agent does not get stuck in a suboptimal loop. By taking random actions, the agent eventually wanders into every possible state, fulfilling the coverage requirement that "Exploring Starts" used to handle.</li>
<li><b><b>Mechanism</b></b>: With probability \(\epsilon\), the agent ignores its knowledge and chooses randomly.</li>
</ul></li>

<li>Exploitation (The \(1-\epsilon\) component)
<ul class="org-ul">
<li><b><b>Purpose</b></b>: To maximize rewards based on current knowledge. The agent selects the "Greedy" action (the one with the highest estimated value \(q(s,a)\)).</li>
<li><b><b>Mechanism</b></b>: With probability \(1 - \epsilon\), the agent chooses the best known action.</li>
</ul></li>
</ul>

<ul class="org-ul">
<li><b><b>Continuous Learning</b></b>: Even if the agent always starts at the same spot (Start Line), the stochastic nature of the policy (\(\epsilon\)) ensures that over many episodes, it will eventually drift into unvisited states.</li>
</ul>
</div>
</div>
</div>
</div>
