RL.org
** From Policy Gradient TO PPO
#+begin_src ditaa :file ./PG.png
  +------+
  |      |
  | ENV  | <------------- A
  |      |                ^
  +------+                |
      |                   |
      |              +--------+
      V              |        |
      S  ----------->|  Actor |
                     |        |
                     +--------+

#+end_src

For a Trajectory: $\tau = {s_{1}, a_{1}, s_{2}, a_{2}, s_{3}, a_{3},....., s_{T}, a_{T} }$,
The Actor wants to learn the policy,
each step:  $p_{\theta}(a_{t}|s_{t})$,
total trajectory: $p_{\theta}(\tau) = p(s_{1})p_{\theta}(a_{1}|s_{1}) \cdot  p(s_{2}|s_{1}, a_{1})p_{\theta}(a_{2}|s_{2}) \cdot
p(s_{3}|s_{2}, a_{2})p_{\theta}(a_{3}|s_{3})  .....
p(s_{T}|s_{T-1}, a_{T-1})p_{\theta}(a_{T}|s_{T})$,
So we have $p_{\theta}(\tau) = p(s_{1}) \cdot \prod_{t=1}^{T}
p_{\theta}(a_{t}|s_{t}) p(s_{t+1}|s_{t}, a_{t})$.


About the Policy $R_{\theta}$ we get its expecation $\bar{R_{\theta}} = \sum_{\tau}R(\tau)p_{\theta}(\tau)$.
so its gradient: $\Delta \bar{R_{\theta}} = \sum_{\tau}R(\tau) \Delta p_{\theta}(\tau)$.
$\Delta \bar{R_{\theta}} = \sum_{\tau}R(\tau) p_{\theta}(\tau)  \frac{\Delta p_{\theta}(\tau) }{p_{\theta}(\tau)}$.  by using $(\log(f(x)))' = \frac{f'(x)}{f(x)}$

So we have  $\Delta \bar{R_{\theta}} = \sum_{\tau}R(\tau) p_{\theta}(\tau)  \Delta \log p_{\theta}(\tau)$.

Assuming we have N Trajectories with porbablity of $p_{\theta}(\tau)$:
  $\Delta \bar{R_{\theta}} = \frac{1}{N} \sum_{n=1}^{N} R(\tau^{n})  \Delta \log p_{\theta}(\tau^{n})$.

Expanding all the probablity of each possiable actions:
  $\Delta \bar{R_{\theta}} = \frac{1}{N} \sum_{n=1}^{N} \sum_{t=1}^{T_{n}} R(t)  \Delta \log p_{\theta}( a_{t}^{n} | s_{t}^{n} )$.

Using Advantage function $A$ replace Reward function $R$, and add baseline:
$A_{t} = Q(s_{t}, a_{t}) - V(s_{t})$

so th Policy Gradient Objective function is:
$J(\theta) = E_{t}[\log p_{\theta}(a_{t}|s_{t})A_{t}]$ and $\Delta J(\theta) = E_{t}[\Delta_{\theta} \log p_{\theta}(a_{t}|s_{t})A_{t}]$

On Policy has Data Inefficiency, which slow dwon the training very much and unstable. We have following adjustments available.

- Mini-Batch training from On Policy to Off Policy with importance exampling:
  From $\Delta J(\theta) = E_{(s_{t}, a_{t}) \backsim p_{\theta}}[ A_{\theta}(s_{t}, a_{t})  \Delta_{\theta} \log p_{\theta}(a_{t}|s_{t})]$
  with importance exampling:  $E_{x \backsim p[f(x)]} \approx \frac{1}{N} \sum_{i=1}^{N} f(x_{i}) = \int f(x)p(x)dx  = \int f(x)\frac{p(x)}{q(x)}q(x)dx = E_{x \backsim q[f(x)]}[f(x) \frac{p(x)}{q(x)}]$
  we have  $\Delta J(\theta) = E_{(s_{t}, a_{t}) \backsim p_{\theta^{'}}}[ \frac{p_{\theta}(s_{t}, a_{t})}{p_{\theta^{'}}(s_{t}, a_{t})} A_{\theta^{'}}(s_{t}, a_{t})  \Delta_{\theta} \log p_{\theta}(a_{t}|s_{t})]$.
  
  Expanding the join condition:    $\Delta J(\theta) = E_{(s_{t}, a_{t}) \backsim p_{\theta^{'}}}[\frac{p_{\theta}(s_{t}| a_{t}) p_{\theta}(s_{t})}{p_{\theta^{'}}(s_{t}| a_{t}) p_{\theta^{'}}(s_{t})} A_{\theta^{'}}(s_{t}, a_{t})  \Delta_{\theta} \log p_{\theta}(a_{t}|s_{t})]$
  
  because $\frac{p_{\theta}(s_{t})}{p_{\theta^{'}}(s_{t})} \approx 1$,   we have $\Delta J(\theta) = E_{(s_{t}, a_{t}) \backsim p_{\theta^{'}}}[\frac{p_{\theta}(s_{t}| a_{t})}{p_{\theta^{'}}(s_{t}| a_{t})} A_{\theta^{'}}(s_{t}, a_{t})  \Delta_{\theta} \log p_{\theta}(a_{t}|s_{t})]$.
  
  Because $\Delta f(x) = \frac{f(x)}{\Delta \log_{f(x)}}$,   we have the Policy function  $J_{\theta^{'}}(\theta) = E_{(s_{t}, a_{t}) \backsim p_{\theta^{'}}}[\frac{p_{\theta}(s_{t}| a_{t})}{p_{\theta^{'}}(s_{t}| a_{t})} A_{\theta^{'}}(s_{t}, a_{t})]$, its differential with respect of $\theta$ is $\Delta J(\theta)$.

  If we choice the example of $\theta^{'}$ from pervious iteration, we can transition on policy to off policy by importance exampling.

- Regularization:
  using KL Divergence to constrain the difference between $\theta$ and  $\theta^{'}$.   $D_{KL}(p||q) = E[\log p(x) - \log q(x)] = \sum_{x} p(x)\log \frac{p(x)}{qx}$

  So The Objective Funciton of  PPO with KL penalty: $J_{\theta^{'}}^{PPO}(\theta) = J_{\theta^{'}}(\theta) - \beta D_{KL}(p_{\theta} || p_{\theta^{'}})$ where $J_{\theta^{'}}(\theta) = E_{(s_{t}, a_{t}) \backsim p_{\theta^{'}}}[\frac{p_{\theta}(s_{t}| a_{t})}{p_{\theta^{'}}(s_{t}| a_{t})} A_{\theta^{'}}(s_{t}, a_{t})]$ as in mini batch.

  to train the KL Penalty,
  - if $D_{KL}(p_{\theta} || p_{\theta^{'}})$ > $D_{max}$, increase $\beta$
  - if $D_{KL}(p_{\theta} || p_{\theta^{'}})$ < $D_{min}$, decrease $\beta$

- Clipped Objective
  limit the maximal and minimal of $h_{t}(\theta) = \frac{p_{\theta}(a_{t}|s_{t})}p_{\theta^{'}}(a_{t}|s_{t})$ with limitation $\epsilon$.

  $L_{\theta_{k}}^{CLIP} = E(\sum_{t=0}^{T}  [\min {h_{t}A_{t}, clip(h_{t}, 1-\epsilon, 1+\epsilon)A_{t}}])$.
  
* DeepSeek

** Multi-head Latent Attention mechanismus
using auto-encoder to compress the K and V with unified repersentatoin
** MoE
*** with shared Experts for common sense training
*** load balance
in order to training all Experts P, 
- Switch transformer, minimal the loss to force the f and P to be uniformly distributed : $loss = \alpha \cdot N \cdot \sum_{i=1}^{N} f_{i} \cdot P_{i}$
- Loss free: using self-adjusted bias before softmax to control the P.
  - if some experts has too much token, decrease the bias,
  - if some experts has too less token, incurease the bias.

- DeepSeek use bias parameter before active function for dynamical adjustment of token loading for each expert    
** Multi token prodiction
*** Orignal idea: 
predict multiple token, some are from small model. If LLM accepte them, it does not need to generate them again.
