html/RL.html
<div id="outline-container-org4118dc8" class="outline-2">
<h2 id="org4118dc8"><span class="section-number-2">5.</span> PPO</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orga2fb1c4" class="outline-3">
<h3 id="orga2fb1c4"><span class="section-number-3">5.1.</span> From Policy Gradient TO PPO</h3>
<div class="outline-text-3" id="text-5-1">
<p>
For a Trajectory: \(\tau = {s_{1}, a_{1}, s_{2}, a_{2}, s_{3}, a_{3},....., s_{T}, a_{T} }\),
The Actor wants to learn the policy,
each step:  \(p_{\theta}(a_{t}|s_{t})\),
total trajectory: \(p_{\theta}(\tau) = p(s_{1})p_{\theta}(a_{1}|s_{1}) \cdot  p(s_{2}|s_{1}, a_{1})p_{\theta}(a_{2}|s_{2}) \cdot
p(s_{3}|s_{2}, a_{2})p_{\theta}(a_{3}|s_{3})  .....
p(s_{T}|s_{T-1}, a_{T-1})p_{\theta}(a_{T}|s_{T})\),
So we have \(p_{\theta}(\tau) = p(s_{1}) \cdot \prod_{t=1}^{T}
p_{\theta}(a_{t}|s_{t}) p(s_{t+1}|s_{t}, a_{t})\).
</p>


<p>
About the Policy \(R_{\theta}\) we get its expecation \(\bar{R_{\theta}} = \sum_{\tau}R(\tau)p_{\theta}(\tau)\).
so its gradient: \(\Delta \bar{R_{\theta}} = \sum_{\tau}R(\tau) \Delta p_{\theta}(\tau)\).
\(\Delta \bar{R_{\theta}} = \sum_{\tau}R(\tau) p_{\theta}(\tau)  \frac{\Delta p_{\theta}(\tau) }{p_{\theta}(\tau)}\).  by using \((\log(f(x)))' = \frac{f'(x)}{f(x)}\)
</p>

<p>
So we have  \(\Delta \bar{R_{\theta}} = \sum_{\tau}R(\tau) p_{\theta}(\tau)  \Delta \log p_{\theta}(\tau)\).
</p>

<p>
Assuming we have N Trajectories with porbablity of \(p_{\theta}(\tau)\):
  \(\Delta \bar{R_{\theta}} = \frac{1}{N} \sum_{n=1}^{N} R(\tau^{n})  \Delta \log p_{\theta}(\tau^{n})\).
</p>

<p>
Expanding all the probablity of each possiable actions:
  \(\Delta \bar{R_{\theta}} = \frac{1}{N} \sum_{n=1}^{N} \sum_{t=1}^{T_{n}} R(t)  \Delta \log p_{\theta}( a_{t}^{n} | s_{t}^{n} )\).
</p>

<p>
Using Advantage function \(A\) replace Reward function \(R\), and add baseline:
\(A_{t} = Q(s_{t}, a_{t}) - V(s_{t})\)
</p>

<p>
so th Policy Gradient Objective function is:
\(J(\theta) = E_{t}[\log p_{\theta}(a_{t}|s_{t})A_{t}]\) and \(\Delta J(\theta) = E_{t}[\Delta_{\theta} \log p_{\theta}(a_{t}|s_{t})A_{t}]\)
</p>

<p>
On Policy has Data Inefficiency, which slow dwon the training very much and unstable. We have following adjustments available.
</p>

<ul class="org-ul">
<li><p>
Mini-Batch training from On Policy to Off Policy with importance exampling:
From \(\Delta J(\theta) = E_{(s_{t}, a_{t}) \backsim p_{\theta}}[ A_{\theta}(s_{t}, a_{t})  \Delta_{\theta} \log p_{\theta}(a_{t}|s_{t})]\)
with importance exampling:  \(E_{x \backsim p[f(x)]} \approx \frac{1}{N} \sum_{i=1}^{N} f(x_{i}) = \int f(x)p(x)dx  = \int f(x)\frac{p(x)}{q(x)}q(x)dx = E_{x \backsim q[f(x)]}[f(x) \frac{p(x)}{q(x)}]\)
we have  \(\Delta J(\theta) = E_{(s_{t}, a_{t}) \backsim p_{\theta^{'}}}[ \frac{p_{\theta}(s_{t}, a_{t})}{p_{\theta^{'}}(s_{t}, a_{t})} A_{\theta^{'}}(s_{t}, a_{t})  \Delta_{\theta} \log p_{\theta}(a_{t}|s_{t})]\).
</p>

<p>
Expanding the join condition:    \(\Delta J(\theta) = E_{(s_{t}, a_{t}) \backsim p_{\theta^{'}}}[\frac{p_{\theta}(s_{t}| a_{t}) p_{\theta}(s_{t})}{p_{\theta^{'}}(s_{t}| a_{t}) p_{\theta^{'}}(s_{t})} A_{\theta^{'}}(s_{t}, a_{t})  \Delta_{\theta} \log p_{\theta}(a_{t}|s_{t})]\)
</p>

<p>
because \(\frac{p_{\theta}(s_{t})}{p_{\theta^{'}}(s_{t})} \approx 1\),   we have \(\Delta J(\theta) = E_{(s_{t}, a_{t}) \backsim p_{\theta^{'}}}[\frac{p_{\theta}(s_{t}| a_{t})}{p_{\theta^{'}}(s_{t}| a_{t})} A_{\theta^{'}}(s_{t}, a_{t})  \Delta_{\theta} \log p_{\theta}(a_{t}|s_{t})]\).
</p>

<p>
Because \(\Delta f(x) = \frac{f(x)}{\Delta \log_{f(x)}}\),   we have the Policy function  \(J_{\theta^{'}}(\theta) = E_{(s_{t}, a_{t}) \backsim p_{\theta^{'}}}[\frac{p_{\theta}(s_{t}| a_{t})}{p_{\theta^{'}}(s_{t}| a_{t})} A_{\theta^{'}}(s_{t}, a_{t})]\), its differential with respect of \(\theta\) is \(\Delta J(\theta)\).
</p>

<p>
If we choice the example of \(\theta^{'}\) from pervious iteration, we can transition on policy to off policy by importance exampling.
</p></li>

<li><p>
Regularization:
using KL Divergence to constrain the difference between \(\theta\) and  \(\theta^{'}\).   \(D_{KL}(p||q) = E[\log p(x) - \log q(x)] = \sum_{x} p(x)\log \frac{p(x)}{qx}\)
</p>

<p>
So The Objective Funciton of  PPO with KL penalty: \(J_{\theta^{'}}^{PPO}(\theta) = J_{\theta^{'}}(\theta) - \beta D_{KL}(p_{\theta} || p_{\theta^{'}})\) where \(J_{\theta^{'}}(\theta) = E_{(s_{t}, a_{t}) \backsim p_{\theta^{'}}}[\frac{p_{\theta}(s_{t}| a_{t})}{p_{\theta^{'}}(s_{t}| a_{t})} A_{\theta^{'}}(s_{t}, a_{t})]\) as in mini batch.
</p>

<p>
to train the KL Penalty,
</p>
<ul class="org-ul">
<li>if \(D_{KL}(p_{\theta} || p_{\theta^{'}})\) &gt; \(D_{max}\), increase \(\beta\)</li>
<li>if \(D_{KL}(p_{\theta} || p_{\theta^{'}})\) &lt; \(D_{min}\), decrease \(\beta\)</li>
</ul></li>

<li><p>
Clipped Objective
limit the maximal and minimal of \(h_{t}(\theta) = \frac{p_{\theta}(a_{t}|s_{t})}p_{\theta^{'}}(a_{t}|s_{t})\) with limitation \(\epsilon\).
</p>

<p>
\(L_{\theta_{k}}^{CLIP} = E(\sum_{t=0}^{T}  [\min {h_{t}A_{t}, clip(h_{t}, 1-\epsilon, 1+\epsilon)A_{t}}])\).
</p></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orga335e4c" class="outline-2">
<h2 id="orga335e4c"><span class="section-number-2">6.</span> DeepSeek</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgf727247" class="outline-3">
<h3 id="orgf727247"><span class="section-number-3">6.1.</span> Multi-head Latent Attention mechanismus</h3>
<div class="outline-text-3" id="text-6-1">
<p>
using auto-encoder to compress the K and V with unified repersentatoin
</p>
</div>
</div>
<div id="outline-container-org09392be" class="outline-3">
<h3 id="org09392be"><span class="section-number-3">6.2.</span> MoE</h3>
<div class="outline-text-3" id="text-6-2">
</div>
<div id="outline-container-orgb3d8a2f" class="outline-4">
<h4 id="orgb3d8a2f"><span class="section-number-4">6.2.1.</span> with shared Experts for common sense training</h4>
</div>
<div id="outline-container-org3063247" class="outline-4">
<h4 id="org3063247"><span class="section-number-4">6.2.2.</span> load balance</h4>
<div class="outline-text-4" id="text-6-2-2">
<p>
in order to training all Experts P, 
</p>
<ul class="org-ul">
<li>Switch transformer, minimal the loss to force the f and P to be uniformly distributed : \(loss = \alpha \cdot N \cdot \sum_{i=1}^{N} f_{i} \cdot P_{i}\)</li>
<li>Loss free: using self-adjusted bias before softmax to control the P.
<ul class="org-ul">
<li>if some experts has too much token, decrease the bias,</li>
<li>if some experts has too less token, incurease the bias.</li>
</ul></li>

<li>DeepSeek use bias parameter before active function for dynamical adjustment of token loading for each expert</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgf422380" class="outline-3">
<h3 id="orgf422380"><span class="section-number-3">6.3.</span> Multi token prodiction</h3>
<div class="outline-text-3" id="text-6-3">
</div>
<div id="outline-container-org77648af" class="outline-4">
<h4 id="org77648af"><span class="section-number-4">6.3.1.</span> Orignal idea:</h4>
<div class="outline-text-4" id="text-6-3-1">
<p>
predict multiple token, some are from small model. If LLM accepte them, it does not need to generate them again.
</p>
</div>
</div>
